Обработки/Reports/_ОтчетПоДоходуОтНКД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_ОтчетПоДоходуОтНКД</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_ОтчетПоДоходуОтНКД/Ext/ObjectModule.bsl
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет,
		"ОтчетПоДоходуОтНКД",
		"0.05",
		"",
		Истина);
	
	РегистрационныеДанные.Вставить("Команды", РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд());
	
	Возврат РегистрационныеДанные;
	
КонецФункции

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	Настройки = КомпоновщикНастроек.Настройки;

	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Организация", 					ЭтотОбъект.Организация);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("СчетДУ", 	ЭтотОбъект.СчетДоверительногоУправления);
	
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("НачалоПериода", 						ЭтотОбъект.Период.ДатаНачала);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("КонецПериода", 						КонецДня(ЭтотОбъект.Период.ДатаОкончания));
	//Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ГраницаОкончания", 				Новый Граница(КонецДня(ЭтотОбъект.Период.ДатаОкончания), ВидГраницы.Включая));
		
	//Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ВидыЗадолженностиСПредварительнымНачислением", 
	//																						Справочники.ВидыЗадолженности.ВидыЗадолженностиСПредварительнымНачислением(ЭтотОбъект.Организация, ЭтотОбъект.Период));
	//Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("НКО_НКЦ", 						ОбщегоНазначения.ПолучитьИменованныйОбъект("НКО_НКЦ"));
	
	РаботаСОтчетами.ВыполнитьКомпоновкуПрограммно(ЭтотОбъект, ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка);
	
КонецПроцедуры
